Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Посещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВъездаНаПарковку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыездаСПарковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПосещениеЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Посещение/Ext/ManagerModule.bsl
&Вместо("УстановитьСтатусыПрибытияКлиента")
Процедура PocketKey_УстановитьСтатусыПрибытияКлиента(СтруктурнаяЕдиница, Контрагент, ДатаПрихода, ДатаУхода)

	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗанятия.Ссылка КАК СтатусЗанятия
	|ПОМЕСТИТЬ ТаблицаСтатусыЗанятия
	|ИЗ
	|	Перечисление.СтатусыЗанятия КАК СтатусыЗанятия
	|ГДЕ
	|	СтатусыЗанятия.Ссылка <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Отменено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыЗанятий.Ссылка КАК ТипЗанятия
	|ПОМЕСТИТЬ ТаблицаТипыЗанятий
	|ИЗ
	|	Перечисление.ТипыЗанятий КАК ТипыЗанятий
	|ГДЕ
	|	ТипыЗанятий.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыЗанятий.ГрупповоеЗанятие), ЗНАЧЕНИЕ(Перечисление.ТипыЗанятий.ПерсональноеЗанятие), ЗНАЧЕНИЕ(Перечисление.ТипыЗанятий.АрендаЗала))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыУчетаПрибытияКлиентаНаЗанятие.Ссылка КАК ВариантУчетаПрибытия
	|ПОМЕСТИТЬ ТаблицаВариантовУчетаПрибытия
	|ИЗ
	|	Перечисление.ВариантыУчетаПрибытияКлиентаНаЗанятие КАК ВариантыУчетаПрибытияКлиентаНаЗанятие
	|ГДЕ
	|	ВариантыУчетаПрибытияКлиентаНаЗанятие.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаПрибытияКлиентаНаЗанятие.ОтмечаетТренер)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументЗанятие.Ссылка КАК Занятие,
	|	ДокументЗанятие.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ДокументЗанятие.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ДокументЗанятие.Номенклатура КАК Номенклатура,
	|	ДокументЗанятие.СтатусЗанятия КАК СтатусЗанятия,
	|	ДокументЗанятие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДокументЗанятие.ТипЗанятия КАК ТипЗанятия
	|ПОМЕСТИТЬ ТаблицаЗанятийНаДату
	|ИЗ
	|	Документ.Занятие КАК ДокументЗанятие
	|ГДЕ
	|	ДокументЗанятие.Проведен = ИСТИНА
	|	И НАЧАЛОПЕРИОДА(ДокументЗанятие.ДатаВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПрихода, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗанятийНаДату.Занятие КАК Занятие
	|ПОМЕСТИТЬ ТаблицаЗанятийПоСЕ
	|ИЗ
	|	ТаблицаЗанятийНаДату КАК ТаблицаЗанятийНаДату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСтатусыЗанятия КАК ТаблицаСтатусыЗанятия
	|		ПО ТаблицаЗанятийНаДату.СтатусЗанятия = ТаблицаСтатусыЗанятия.СтатусЗанятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТипыЗанятий КАК ТаблицаТипыЗанятий
	|		ПО ТаблицаЗанятийНаДату.ТипЗанятия = ТаблицаТипыЗанятий.ТипЗанятия
	|ГДЕ
	|	(&ДатаПрихода МЕЖДУ ДОБАВИТЬКДАТЕ(ТаблицаЗанятийНаДату.ДатаВремяНачала, МИНУТА, -1 * &ВремяПереодеванияДоЗанятия) И ДОБАВИТЬКДАТЕ(ТаблицаЗанятийНаДату.ДатаВремяОкончания, СЕКУНДА, -1)
	|			ИЛИ &ДатаПрихода <> ДАТАВРЕМЯ(1, 1, 1)
	|				И &ДатаУхода <> ДАТАВРЕМЯ(1, 1, 1)
	|				И (ТаблицаЗанятийНаДату.ДатаВремяНачала МЕЖДУ &ДатаПрихода И &ДатаУхода))
	|	И ТаблицаЗанятийНаДату.Номенклатура.УслугаТипОтметкиПрибытияНаЗанятие В
	|			(ВЫБРАТЬ
	|				ТаблицаВариантовУчетаПрибытия.ВариантУчетаПрибытия
	|			ИЗ
	|				ТаблицаВариантовУчетаПрибытия)
	|	И ТаблицаЗанятийНаДату.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятиеСоставЗанятия.Ссылка КАК Занятие,
	|	ЗанятиеСоставЗанятия.Контрагент КАК Контрагент,
	|	ЗанятиеСоставЗанятия.СтатусПрибытия КАК СтатусПрибытия,
	|	ЗанятиеСоставЗанятия.ДатаБронирования КАК ДатаБронирования
	|ПОМЕСТИТЬ ТаблицаСоставЗанятия
	|ИЗ
	|	Документ.Занятие.СоставЗанятия КАК ЗанятиеСоставЗанятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗанятийПоСЕ КАК ТаблицаЗанятийПоСЕ
	|		ПО ЗанятиеСоставЗанятия.Ссылка = ТаблицаЗанятийПоСЕ.Занятие
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаписьНаЗанятие.Занятие,
	|	ЗаписьНаЗанятие.Контрагент,
	|	ЗаписьНаЗанятие.СтатусПрибытия,
	|	ЗаписьНаЗанятие.ДатаБронирования
	|ИЗ
	|	Документ.ЗаписьНаЗанятие КАК ЗаписьНаЗанятие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗанятийПоСЕ КАК ТаблицаЗанятийПоСЕ
	|		ПО ЗаписьНаЗанятие.Занятие = ТаблицаЗанятийПоСЕ.Занятие	И ЗаписьНаЗанятие.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСоставЗанятия.Занятие КАК Занятие
	|ИЗ
	|	ТаблицаСоставЗанятия КАК ТаблицаСоставЗанятия
	|ГДЕ
	|	ТаблицаСоставЗанятия.Контрагент = &Контрагент
	|	И ТаблицаСоставЗанятия.СтатусПрибытия = 0
	|	И ТаблицаСоставЗанятия.ДатаБронирования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";

	Запрос.УстановитьПараметр("Контрагент" 					 , Контрагент);
	Запрос.УстановитьПараметр("ДатаПрихода"					 , ДатаПрихода);
	Запрос.УстановитьПараметр("ДатаУхода"  					 , ДатаУхода);
	Запрос.УстановитьПараметр("ВремяПереодеванияДоЗанятия"   , Константы.ВремяПереодеванияДоЗанятия.Получить());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВремяПереодеванияДоЗанятия"   , Константы.ВремяПереодеванияДоЗанятия.Получить());

	МетаданныеДокумента 	= Метаданные.Документы.Занятие;
	ПредставлениеДокумента 	= МетаданныеДокумента.Представление();

	ТаблицаЗанятий = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из ТаблицаЗанятий Цикл
		//НачатьТранзакцию();
		Попытка
			ПараметрыЗаписи = Неопределено;
			Документы.Занятие.ИнициализироватьПараметрыЗаписи(ПараметрыЗаписи, РежимЗаписиДокумента.Проведение, , , Истина);

			//Блокировка = Новый БлокировкаДанных;
			//ЭлементБлокировки = Блокировка.Добавить("Документ.Занятие");
			//ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТЧ.Занятие);
			//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//Блокировка.Заблокировать();

			ОбъектЗанятие = Неопределено;
			ОбъектЗанятие = СтрокаТЧ.Занятие.ПолучитьОбъект();
			ТаблицаСоставаЗанятия = Неопределено;
			Документы.Занятие.ИнициализироватьТекущийСоставЗанятия(, ОбъектЗанятие, ТаблицаСоставаЗанятия);

			НайденныеСтроки = ТаблицаСоставаЗанятия.НайтиСтроки(Новый Структура("Контрагент", Контрагент));
			Для Каждого СтрокаСоставаЗанятия Из НайденныеСтроки Цикл
				СтрокаСоставаЗанятия.СтатусПрибытия = 1;
			КонецЦикла;
			ОбъектЗанятие.ДополнительныеСвойства.Вставить("РасчетКонтрагента"	, Контрагент);
			ОбъектЗанятие.ДополнительныеСвойства.Вставить("НеСоздаватьПосещение", Истина);
			Документы.Занятие.ЗаписатьОбъект(ОбъектЗанятие, , ТаблицаСоставаЗанятия, ПараметрыЗаписи);	
			Если ПараметрыЗаписи.ДанныеПроверки.ЗаписьЗапрещена Тогда
				ВызватьИсключение ПараметрыЗаписи.ДанныеПроверки.ОписаниеОграничения;
			КонецЕсли;
			//ЗафиксироватьТранзакцию();
		Исключение
			//ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("Ошибка установки статуса клиента"
			, УровеньЖурналаРегистрации.Ошибка
			, МетаданныеДокумента
			, СтрокаТЧ.Занятие
			, ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
